// Generated by jextract

package com.ustermetrics.clarabel4j.bindings;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct ClarabelDefaultSettings_f64 {
 *     uint32_t max_iter;
 *     double time_limit;
 *     bool verbose;
 *     double max_step_fraction;
 *     double tol_gap_abs;
 *     double tol_gap_rel;
 *     double tol_feas;
 *     double tol_infeas_abs;
 *     double tol_infeas_rel;
 *     double tol_ktratio;
 *     double reduced_tol_gap_abs;
 *     double reduced_tol_gap_rel;
 *     double reduced_tol_feas;
 *     double reduced_tol_infeas_abs;
 *     double reduced_tol_infeas_rel;
 *     double reduced_tol_ktratio;
 *     bool equilibrate_enable;
 *     uint32_t equilibrate_max_iter;
 *     double equilibrate_min_scaling;
 *     double equilibrate_max_scaling;
 *     double linesearch_backtrack_step;
 *     double min_switch_step_length;
 *     double min_terminate_step_length;
 *     uint32_t max_threads;
 *     bool direct_kkt_solver;
 *     ClarabelDirectSolveMethods direct_solve_method;
 *     bool static_regularization_enable;
 *     double static_regularization_constant;
 *     double static_regularization_proportional;
 *     bool dynamic_regularization_enable;
 *     double dynamic_regularization_eps;
 *     double dynamic_regularization_delta;
 *     bool iterative_refinement_enable;
 *     double iterative_refinement_reltol;
 *     double iterative_refinement_abstol;
 *     uint32_t iterative_refinement_max_iter;
 *     double iterative_refinement_stop_ratio;
 *     bool presolve_enable;
 *     int32_t pardiso_iparm[64];
 *     bool pardiso_verbose;
 * }
 * }
 */
public class ClarabelDefaultSettings_f64 {

    ClarabelDefaultSettings_f64() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        Clarabel_h.C_INT.withName("max_iter"),
        MemoryLayout.paddingLayout(4),
        Clarabel_h.C_DOUBLE.withName("time_limit"),
        Clarabel_h.C_BOOL.withName("verbose"),
        MemoryLayout.paddingLayout(7),
        Clarabel_h.C_DOUBLE.withName("max_step_fraction"),
        Clarabel_h.C_DOUBLE.withName("tol_gap_abs"),
        Clarabel_h.C_DOUBLE.withName("tol_gap_rel"),
        Clarabel_h.C_DOUBLE.withName("tol_feas"),
        Clarabel_h.C_DOUBLE.withName("tol_infeas_abs"),
        Clarabel_h.C_DOUBLE.withName("tol_infeas_rel"),
        Clarabel_h.C_DOUBLE.withName("tol_ktratio"),
        Clarabel_h.C_DOUBLE.withName("reduced_tol_gap_abs"),
        Clarabel_h.C_DOUBLE.withName("reduced_tol_gap_rel"),
        Clarabel_h.C_DOUBLE.withName("reduced_tol_feas"),
        Clarabel_h.C_DOUBLE.withName("reduced_tol_infeas_abs"),
        Clarabel_h.C_DOUBLE.withName("reduced_tol_infeas_rel"),
        Clarabel_h.C_DOUBLE.withName("reduced_tol_ktratio"),
        Clarabel_h.C_BOOL.withName("equilibrate_enable"),
        MemoryLayout.paddingLayout(3),
        Clarabel_h.C_INT.withName("equilibrate_max_iter"),
        Clarabel_h.C_DOUBLE.withName("equilibrate_min_scaling"),
        Clarabel_h.C_DOUBLE.withName("equilibrate_max_scaling"),
        Clarabel_h.C_DOUBLE.withName("linesearch_backtrack_step"),
        Clarabel_h.C_DOUBLE.withName("min_switch_step_length"),
        Clarabel_h.C_DOUBLE.withName("min_terminate_step_length"),
        Clarabel_h.C_INT.withName("max_threads"),
        Clarabel_h.C_BOOL.withName("direct_kkt_solver"),
        MemoryLayout.paddingLayout(3),
        Clarabel_h.C_INT.withName("direct_solve_method"),
        Clarabel_h.C_BOOL.withName("static_regularization_enable"),
        MemoryLayout.paddingLayout(3),
        Clarabel_h.C_DOUBLE.withName("static_regularization_constant"),
        Clarabel_h.C_DOUBLE.withName("static_regularization_proportional"),
        Clarabel_h.C_BOOL.withName("dynamic_regularization_enable"),
        MemoryLayout.paddingLayout(7),
        Clarabel_h.C_DOUBLE.withName("dynamic_regularization_eps"),
        Clarabel_h.C_DOUBLE.withName("dynamic_regularization_delta"),
        Clarabel_h.C_BOOL.withName("iterative_refinement_enable"),
        MemoryLayout.paddingLayout(7),
        Clarabel_h.C_DOUBLE.withName("iterative_refinement_reltol"),
        Clarabel_h.C_DOUBLE.withName("iterative_refinement_abstol"),
        Clarabel_h.C_INT.withName("iterative_refinement_max_iter"),
        MemoryLayout.paddingLayout(4),
        Clarabel_h.C_DOUBLE.withName("iterative_refinement_stop_ratio"),
        Clarabel_h.C_BOOL.withName("presolve_enable"),
        MemoryLayout.paddingLayout(3),
        MemoryLayout.sequenceLayout(64, Clarabel_h.C_INT).withName("pardiso_iparm"),
        Clarabel_h.C_BOOL.withName("pardiso_verbose"),
        MemoryLayout.paddingLayout(3)
    ).withName("ClarabelDefaultSettings_f64");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt max_iter$LAYOUT = (OfInt)$LAYOUT.select(groupElement("max_iter"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint32_t max_iter
     * }
     */
    public static final OfInt max_iter$layout() {
        return max_iter$LAYOUT;
    }

    private static final long max_iter$OFFSET = $LAYOUT.byteOffset(groupElement("max_iter"));

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint32_t max_iter
     * }
     */
    public static final long max_iter$offset() {
        return max_iter$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint32_t max_iter
     * }
     */
    public static int max_iter(MemorySegment struct) {
        return struct.get(max_iter$LAYOUT, max_iter$OFFSET);
